{"name":"Ranil","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Ranil Bazira - curious","headerTaglineThree":"designer and devloper","headerTaglineFour":" based in New Delhi, India.","showCursor":true,"showBlog":false,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/RanBaz"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/ranil-bazira-8631112a0/"},{"id":"5","title":"Email","link":"mailto:ranbaz00@gmail.com"}],"projects":[{"id":"1","title":"Wardrobe Wizard","description":"Developed an AI-driven Django platform for outfit selection and shopping, featuring Virtual Try-On, personalized recommendations, and wardrobe integration. Users upload clothing screenshots to visualize fits instantly. Built custom models to analyze preferences and suggest styles, seamlessly connecting users with brands. Published patent for the innovative concept.","imageSrc":"https://i.pinimg.com/736x/1e/4f/67/1e4f67a19edcedee8364c27df8dda7cc.jpg","url":"https://drive.google.com/file/d/1KsHvoUXjkWVsN1YpyGqAeH8aRerQBXpU/view?usp=sharing"},{"id":"2","title":"Numunch","description":"Developed a full stack e-commerce website using React, Node.js, Express, and MongoDB. Implemented features such as user authentication, product search, and shopping cart. Deployed the application on Render for scalable performance. Also has mobile version built in Flutter.","imageSrc":"https://mir-s3-cdn-cf.behance.net/project_modules/1400/81fd1e100718715.5f0ef9fe9e100.png","url":"https://numunch1-2.onrender.com/"},{"id":"3","title":"Django Rag","description":"Designed a medical diagnosis agent using multi-modal inputs (Clinical data, Reports, Lab tests, X-rays, DNA tests) to extract symptoms via ETL pipeline. Matched symptoms with ICD data for disease identification. Leveraged ML models (NLP, CV), Fine Tuned LLMs and knowledge graphs for validation. Ensured explainability with SHAP/LIME. Compliant with HIPAA/GDPR. Tools: Python, TensorFlow, PyTorch, AWS. Delivered AI-driven, data-backed diagnostic solutions for accurate and efficient disease identification.","imageSrc":"https://www.guideir.com/Public/Uploads/uploadfile/images/20220609/16MedicalDiagnosis2.jpg","url":""},{"id":"4","title":"NU Health","description":"Developed NU Health, a Node.js and Express.js web application for a university's medical team to securely store and manage student medical records. Admins can efficiently reference records to assign appropriate treatments or medications based on diagnosis history. Utilized MongoDB for flexible and scalable data storage and JWT for secure authentication. Enhances medical record management and decision-making for student healthcare.","imageSrc":"https://hips.hearstapps.com/hmg-prod/images/281/main-gettyimages-485855783-1515512813.jpg","url":""}],"services":[{"id":"1","title":"Frontend Development","description":"Creating responsive, user-friendly, and dynamic interfaces using React, Angular, Next.js, Tailwind, and Bootstrap."},{"id":"2","title":"Backend Development","description":"Developing robust server-side applications, REST APIs, and database management using Django, Node.js, Express.js, and Firebase."},{"id":"3","title":"Full-Stack Development","description":"Building end-to-end web applications, integrating frontend and backend for seamless functionality and performance."}],"aboutpara":"I am a 3rd-year B.Tech Computer Science student at NIIT University with a strong academic background and hands-on experience in software development. I completed my 12th and 10th from St. Francis de Sales, Janakpuri, Delhi. Passionate about Data Science and AI, I explore innovative solutions and build projects that enhance user experience and efficiency. I thrive in dynamic environments that foster learning and growth.","resume":{"tagline":"👋  I'm a Software Engineer, Full-Stack Developer.","description":"3rd year B.Tech Computer Science student at NIIT University with an excellent record and keen interest and practical exposure in the field of development, especially in Data Science and Artificial Intelligence.","experiences":[{"id":"1","dates":"Jan 2023 - May 2023","type":"Part Time","position":"Tech Team, IngeNUity","bullets":"Served as a member of the tech team at IngeNUity, Developed and maintained digital solutions for event management, Built registration systems and scheduling tools for university fests, Worked with cross-functional teams to ensure smooth operations, Used technical skills to improve efficiency and user experience."},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"Aug 2023 - Dec 2023","type":"Part Time","position":"Tech Volunteer, GDSC NIIT","bullets":"Served as a Tech Volunteer at Google Developer Student Clubs (GDSC) NIIT, Contributed to community learning and engagement, Conducted workshops on Git, Helped students understand version control, Taught collaboration workflows and best practices for software development."}],"education":{"universityName":"NIIT University","universityDate":"2022-2026","universityPara":"Pursuing B.Tech in Computer Science (3rd Year) at NIIT University, Neemrana, Rajasthan"},"languages":["Python","JavaScript","Java","Dart"],"frameworks":["React","Angular","Next.js","Flutter","Django","Express.js","Bootstrap","Tailwind"],"others":["HTML, CSS","Node.js, Firebase, REST APIs","MySQL, PostgreSQL, MongoDB","AWS, Azure, Google Cloud","Git, GitHub, GitLab"]}}
